[
    {
      "id": "dryve",
      "title": "Dryve",
      "image": "../public/img/projects/resaweb-header.png",
      "date": "03/2024 - 06/2024",
      "description": "Dryve is a sports car booking site created as part of a university project. In the first year of the Technical Bachelor in Multimedia and Internet Professions, we had to create a reservation site on the theme of our choice. Our task was to develop the site using HTML, CSS, PHP, MySQL and Javascript. It was the first real site I'd created individually from A to Z, mixing back-end and front-end.",
      "technologies": ["HTML", "CSS", "JAVASCRIPT", "PHP", "MYSQL"],
      "video": "../public/video/resaweb.webm",
      "website": "https://resaweb.tahar.butmmi.o2switch.site",
      "github": "https://github.com/jeremytahar/resaweb"
    },
    {
        "id": "cicatriz",
        "title": "Cicatriz",
        "image": "../public/img/projects/cicatriz-header.png",
        "date": "10/2024 - 12/2024",
        "description": "Cicatriz is a data visualization site created as part of a university project. In my second year of BUT MMI, we were asked to work in teams of 3 to create a data visualization site on the theme of our choice. We used chart.js for the graphics and leaflet for the interactive map. The site itself is developed in HTML, CSS and Javascript.",
        "technologies": ["HTML", "CSS", "JAVASCRIPT", "CHART.JS", "LEAFLET"],
        "video": "../public/video/cicatriz.webm",
        "website": "https://jeremytahar.github.io/cicatriz",
        "github": "https://github.com/jeremytahar/cicatriz"
    },
    {
        "id": "miniblog",
        "title": "Miniblog",
        "image": "../public/img/projects/miniblog-header.png",
        "date": "10/2024 - 11/2024",
        "description": "I created this miniblog as part of an assignment in my second year of BUT MMI. The aim of this project was to deepen our PHP and MySQL skills by learning how to develop using the MVC architecture. I didn't know anything about MVC before this project and discovered that it's a well-organized way of developing sites that mix front-end and back-end. I also used HTML, CSS and Javascript for layout, styles and interactions.",
        "technologies": ["HTML", "CSS", "JAVASCRIPT", "PHP", "MYSQL"],
        "video": "../public/video/miniblog.webm",
        "website": "https://miniblog.tahar.butmmi.o2switch.site",
        "github": "https://github.com/jeremytahar/miniblog"
    },
    {
        "id": "ent",
        "title": "ENT",
        "image": "../public/img/projects/ent-header.png",
        "date": "10/2024 - 01/2025",
        "description": "The ent was the biggest project of the first semester of the second year of BUT MMI. In teams of 4, we had to carry out a complete redesign of our university's ENT, respecting all the UX methodology prior to developing the site. I developed the site using the MVC architecture and PHP, MySQL, HTML, CSS and Javascript. This project was very close to a real professional project, and I really enjoyed it and learned a lot.",
        "technologies": ["HTML", "CSS", "JAVASCRIPT", "PHP", "MYSQL"],
        "video": "../public/video/ent.webm",
        "website": "https://ent.tahar.butmmi.o2switch.site",
        "github": "https://github.com/jeremytahar/ent"
    },
    {
        "id": "portraitchinois",
        "title": "Portrait Chinois",
        "image": "../public/img/projects/portrait-chinois-header.png",
        "date": "11/2023 - 12/2023",
        "description": "The first project I did as part of my BUT MMI, we had to create a static site in the form of a Chinese portrait. To develop this site, I used HTML, CSS, Javascript and JSON. The various sections are generated in Javascript from the data in the JSON file. I really enjoyed working on this project, which was my first supervised web development project.",
        "technologies": ["HTML", "CSS", "JAVASCRIPT"],
        "video": "../public/video/portrait-chinois.webm",
        "website": "https://portrait-chinois.tahar.butmmi.o2switch.site",
        "github": "https://github.com/jeremytahar/portrait-chinois"
    }
  ]
  